package haikunator_zh

import (
	"fmt"
	"math/rand"
)

var (
	ADJECTIVES = []string{"年迈", "古老", "勇敢", "飘动", "苦涩", "黑色", "蓝色", "大胆",
		"庞大", "破碎", "平静", "寒冷", "凉爽", "红色", "卷曲", "潮湿",
		"黑暗", "气愤", "柔弱", "神圣", "干燥", "闲适", "可恶", "花哨",
		"平坦", "喷香", "香气扑鼻", "冷酷", "温和", "绿色", "离奇", "神圣",
		"冰冷", "快乐", "美丽", "徘徊", "小巧", "活泼", "挺拔", "幸运",
		"雾蒙蒙", "邪恶", "泥泞", "无声", "无名", "嘈杂", "奇怪", "明显",
		"橙色", "耐心", "普通", "抛光", "骄傲", "紫色", "安静", "迅速",
		"沙哑", "红色", "不安", "粗糙", "庞大", "皇家", "闪亮", "高亢",
		"害羞", "安静", "轻盈", "多情", "柔软", "孤独", "闪耀", "春天",
		"方形", "陡峭", "静止", "夏天", "快乐", "甜美", "跳动", "紧张",
		"微小", "潦草", "徘徊", "风化", "白色", "野生", "胆小", "轻柔",
		"枯萎", "黄色", "年轻"}
	NOUNS = []string{"艺术", "乐队", "酒吧", "基地", "雨伞", "方块", "帆船", "奖金",
		"面包", "微风", "小溪", "灌木", "蝴蝶", "蛋糕", "细胞", "樱桃",
		"云朵", "信用", "黑暗", "黎明", "露水", "圆盘", "梦想", "灰尘",
		"羽毛", "田野", "火焰", "萤火虫", "花朵", "雾气", "森林", "青蛙",
		"冰霜", "空地", "闪烁", "草地", "大厅", "帽子", "朦胧", "心脏",
		"山丘", "国王", "实验室", "湖泊", "叶子", "极限", "数学", "草地",
		"模式", "月亮", "早晨", "高山", "鼠标", "泥土", "夜晚", "白纸",
		"松树", "诗歌", "池塘", "女王", "雨衣", "食谱", "共鸣", "米饭",
		"河流", "沙拉", "场景", "海", "阴影", "形状", "寂静", "天空",
		"烟囱", "雪花", "烟花", "声音", "星星", "太阳", "日落",
		"闹钟", "术语", "雷声", "牙齿", "大厦", "真理", "联盟", "单位",
		"紫罗兰", "声音", "苹果", "瀑布", "波浪", "野花", "小狗", "木头"}
)

type Name interface {
	Haikunate() string
	Size() int
}

type RandomName struct {
	r *rand.Rand
}

func (r RandomName) Haikunate() string {
	return fmt.Sprintf("%v的%v", ADJECTIVES[r.r.Intn(len(ADJECTIVES))], NOUNS[r.r.Intn(len(NOUNS))])
}

func (r RandomName) Size() int {
	return len(ADJECTIVES) * len(NOUNS)
}

func New(seed int64) Name {
	name := RandomName{rand.New(rand.New(rand.NewSource(99)))}
	name.r.Seed(seed)
	return name
}
